#### GeometryCreationUtilities Members

---

|  |
| --- |
| GeometryCreationUtilities Class   Methods   See Also |

The  GeometryCreationUtilities  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateBlendGeometry(CurveLoop, CurveLoop, ICollection VertexPair ) | Creates a solid by blending two closed curve loops lying in non-coincident planes. |
| Public method Static member | CreateBlendGeometry(CurveLoop, CurveLoop, ICollection VertexPair , SolidOptions) | Creates a solid by blending two closed curve loops lying in non-coincident planes. |
| Public method Static member | CreateExtrusionGeometry(IList CurveLoop , XYZ, Double) | Creates a solid by linearly extruding one or more closed coplanar curve loops. |
| Public method Static member | CreateExtrusionGeometry(IList CurveLoop , XYZ, Double, SolidOptions) | Creates a solid by linearly extruding one or more closed coplanar curve loops. |
| Public method Static member | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop , XYZ) | Creates a solid by sweeping one or more closed coplanar curve loops along a path while keeping the profile plane oriented so that a line in the plane that is initially perpendicular to a given fixed direction remains perpendicular as the profile is swept along the path. |
| Public method Static member | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop , XYZ, SolidOptions) | Creates a solid by sweeping one or more closed coplanar curve loops along a path while keeping the profile plane oriented so that a line in the plane that is initially perpendicular to a given fixed direction remains perpendicular as the profile is swept along the path. |
| Public method Static member | CreateLoftGeometry | Creates a solid or open shell geometry by lofting between a sequence of curve loops. |
| Public method Static member | CreateRevolvedGeometry(Frame, IList CurveLoop , Double, Double) | Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle. |
| Public method Static member | CreateRevolvedGeometry(Frame, IList CurveLoop , Double, Double, SolidOptions) | Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle. |
| Public method Static member | CreateSweptBlendGeometry(Curve, IList Double , IList CurveLoop , IList ICollection VertexPair ) | Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve. |
| Public method Static member | CreateSweptBlendGeometry(Curve, IList Double , IList CurveLoop , IList ICollection VertexPair , SolidOptions) | Creates a solid by simultaneously sweeping and blending two or more closed planar curve loops along a single curve. |
| Public method Static member | CreateSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop ) | Creates a solid by sweeping one or more closed coplanar curve loops along a path. |
| Public method Static member | CreateSweptGeometry(CurveLoop, Int32, Double, IList CurveLoop , SolidOptions) | Creates a solid by sweeping one or more closed coplanar curve loops along a path. |

# See Also

GeometryCreationUtilities Class

Autodesk.Revit.DB Namespace